ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/devices/include/ip/cyip_flashc.h
/* FLASHC.FLASH_CTL */
#define FLASHC_FLASH_CTL_MAIN_WS_Pos            0UL
#define FLASHC_FLASH_CTL_MAIN_WS_Msk            0xFUL
#define FLASHC_FLASH_CTL_REMAP_Pos              8UL
#define FLASHC_FLASH_CTL_REMAP_Msk              0x100UL
/* FLASHC.FLASH_PWR_CTL */
#define FLASHC_FLASH_PWR_CTL_ENABLE_Pos         0UL
#define FLASHC_FLASH_PWR_CTL_ENABLE_Msk         0x1UL
#define FLASHC_FLASH_PWR_CTL_ENABLE_HV_Pos      1UL
#define FLASHC_FLASH_PWR_CTL_ENABLE_HV_Msk      0x2UL
/* FLASHC.FLASH_CMD */
#define FLASHC_FLASH_CMD_INV_Pos                0UL
#define FLASHC_FLASH_CMD_INV_Msk                0x1UL
/* FLASHC.BIST_CTL */
#define FLASHC_BIST_CTL_OPCODE_Pos              0UL
#define FLASHC_BIST_CTL_OPCODE_Msk              0x3UL
#define FLASHC_BIST_CTL_UP_Pos                  2UL
#define FLASHC_BIST_CTL_UP_Msk                  0x4UL
#define FLASHC_BIST_CTL_ROW_FIRST_Pos           3UL
#define FLASHC_BIST_CTL_ROW_FIRST_Msk           0x8UL
#define FLASHC_BIST_CTL_ADDR_START_ENABLED_Pos  4UL
#define FLASHC_BIST_CTL_ADDR_START_ENABLED_Msk  0x10UL
#define FLASHC_BIST_CTL_ADDR_COMPLIMENT_ENABLED_Pos 5UL
#define FLASHC_BIST_CTL_ADDR_COMPLIMENT_ENABLED_Msk 0x20UL
#define FLASHC_BIST_CTL_INCR_DECR_BOTH_Pos      6UL
#define FLASHC_BIST_CTL_INCR_DECR_BOTH_Msk      0x40UL
#define FLASHC_BIST_CTL_STOP_ON_ERROR_Pos       7UL
#define FLASHC_BIST_CTL_STOP_ON_ERROR_Msk       0x80UL
/* FLASHC.BIST_CMD */
#define FLASHC_BIST_CMD_START_Pos               0UL
#define FLASHC_BIST_CMD_START_Msk               0x1UL
/* FLASHC.BIST_ADDR_START */
#define FLASHC_BIST_ADDR_START_COL_ADDR_START_Pos 0UL
#define FLASHC_BIST_ADDR_START_COL_ADDR_START_Msk 0xFFFFUL
#define FLASHC_BIST_ADDR_START_ROW_ADDR_START_Pos 16UL
#define FLASHC_BIST_ADDR_START_ROW_ADDR_START_Msk 0xFFFF0000UL
/* FLASHC.BIST_DATA */
#define FLASHC_BIST_DATA_DATA_Pos               0UL
#define FLASHC_BIST_DATA_DATA_Msk               0xFFFFFFFFUL
/* FLASHC.BIST_DATA_ACT */
#define FLASHC_BIST_DATA_ACT_DATA_Pos           0UL
#define FLASHC_BIST_DATA_ACT_DATA_Msk           0xFFFFFFFFUL
/* FLASHC.BIST_DATA_EXP */
#define FLASHC_BIST_DATA_EXP_DATA_Pos           0UL
#define FLASHC_BIST_DATA_EXP_DATA_Msk           0xFFFFFFFFUL
/* FLASHC.BIST_ADDR */
#define FLASHC_BIST_ADDR_COL_ADDR_Pos           0UL
#define FLASHC_BIST_ADDR_COL_ADDR_Msk           0xFFFFUL
#define FLASHC_BIST_ADDR_ROW_ADDR_Pos           16UL
#define FLASHC_BIST_ADDR_ROW_ADDR_Msk           0xFFFF0000UL
/* FLASHC.BIST_STATUS */
#define FLASHC_BIST_STATUS_FAIL_Pos             0UL
#define FLASHC_BIST_STATUS_FAIL_Msk             0x1UL
/* FLASHC.CM0_CA_CTL0 */
#define FLASHC_CM0_CA_CTL0_WAY_Pos              16UL
#define FLASHC_CM0_CA_CTL0_WAY_Msk              0x30000UL
#define FLASHC_CM0_CA_CTL0_SET_ADDR_Pos         24UL
#define FLASHC_CM0_CA_CTL0_SET_ADDR_Msk         0x7000000UL
#define FLASHC_CM0_CA_CTL0_PREF_EN_Pos          30UL
#define FLASHC_CM0_CA_CTL0_PREF_EN_Msk          0x40000000UL
#define FLASHC_CM0_CA_CTL0_ENABLED_Pos          31UL
#define FLASHC_CM0_CA_CTL0_ENABLED_Msk          0x80000000UL
/* FLASHC.CM0_CA_CTL1 */
#define FLASHC_CM0_CA_CTL1_PWR_MODE_Pos         0UL
#define FLASHC_CM0_CA_CTL1_PWR_MODE_Msk         0x3UL
#define FLASHC_CM0_CA_CTL1_VECTKEYSTAT_Pos      16UL
#define FLASHC_CM0_CA_CTL1_VECTKEYSTAT_Msk      0xFFFF0000UL
/* FLASHC.CM0_CA_CTL2 */
#define FLASHC_CM0_CA_CTL2_PWRUP_DELAY_Pos      0UL
#define FLASHC_CM0_CA_CTL2_PWRUP_DELAY_Msk      0x3FFUL
/* FLASHC.CM0_CA_CMD */
#define FLASHC_CM0_CA_CMD_INV_Pos               0UL
#define FLASHC_CM0_CA_CMD_INV_Msk               0x1UL
/* FLASHC.CM0_CA_STATUS0 */
#define FLASHC_CM0_CA_STATUS0_VALID16_Pos       0UL
#define FLASHC_CM0_CA_STATUS0_VALID16_Msk       0xFFFFUL
/* FLASHC.CM0_CA_STATUS1 */
#define FLASHC_CM0_CA_STATUS1_TAG_Pos           0UL
#define FLASHC_CM0_CA_STATUS1_TAG_Msk           0xFFFFFFFFUL
/* FLASHC.CM0_CA_STATUS2 */
#define FLASHC_CM0_CA_STATUS2_LRU_Pos           0UL
#define FLASHC_CM0_CA_STATUS2_LRU_Msk           0x3FUL
/* FLASHC.CM4_CA_CTL0 */
#define FLASHC_CM4_CA_CTL0_WAY_Pos              16UL
#define FLASHC_CM4_CA_CTL0_WAY_Msk              0x30000UL
#define FLASHC_CM4_CA_CTL0_SET_ADDR_Pos         24UL
#define FLASHC_CM4_CA_CTL0_SET_ADDR_Msk         0x7000000UL
#define FLASHC_CM4_CA_CTL0_PREF_EN_Pos          30UL
#define FLASHC_CM4_CA_CTL0_PREF_EN_Msk          0x40000000UL
#define FLASHC_CM4_CA_CTL0_ENABLED_Pos          31UL
#define FLASHC_CM4_CA_CTL0_ENABLED_Msk          0x80000000UL
/* FLASHC.CM4_CA_CTL1 */
#define FLASHC_CM4_CA_CTL1_PWR_MODE_Pos         0UL
#define FLASHC_CM4_CA_CTL1_PWR_MODE_Msk         0x3UL
#define FLASHC_CM4_CA_CTL1_VECTKEYSTAT_Pos      16UL
#define FLASHC_CM4_CA_CTL1_VECTKEYSTAT_Msk      0xFFFF0000UL
/* FLASHC.CM4_CA_CTL2 */
#define FLASHC_CM4_CA_CTL2_PWRUP_DELAY_Pos      0UL
#define FLASHC_CM4_CA_CTL2_PWRUP_DELAY_Msk      0x3FFUL
/* FLASHC.CM4_CA_CMD */
#define FLASHC_CM4_CA_CMD_INV_Pos               0UL
#define FLASHC_CM4_CA_CMD_INV_Msk               0x1UL
/* FLASHC.CM4_CA_STATUS0 */
#define FLASHC_CM4_CA_STATUS0_VALID16_Pos       0UL
#define FLASHC_CM4_CA_STATUS0_VALID16_Msk       0xFFFFUL
/* FLASHC.CM4_CA_STATUS1 */
#define FLASHC_CM4_CA_STATUS1_TAG_Pos           0UL
#define FLASHC_CM4_CA_STATUS1_TAG_Msk           0xFFFFFFFFUL
/* FLASHC.CM4_CA_STATUS2 */
#define FLASHC_CM4_CA_STATUS2_LRU_Pos           0UL
#define FLASHC_CM4_CA_STATUS2_LRU_Msk           0x3FUL
/* FLASHC.CRYPTO_BUFF_CTL */
#define FLASHC_CRYPTO_BUFF_CTL_PREF_EN_Pos      30UL
#define FLASHC_CRYPTO_BUFF_CTL_PREF_EN_Msk      0x40000000UL
#define FLASHC_CRYPTO_BUFF_CTL_ENABLED_Pos      31UL
#define FLASHC_CRYPTO_BUFF_CTL_ENABLED_Msk      0x80000000UL
/* FLASHC.CRYPTO_BUFF_CMD */
#define FLASHC_CRYPTO_BUFF_CMD_INV_Pos          0UL
#define FLASHC_CRYPTO_BUFF_CMD_INV_Msk          0x1UL
/* FLASHC.DW0_BUFF_CTL */
#define FLASHC_DW0_BUFF_CTL_PREF_EN_Pos         30UL
#define FLASHC_DW0_BUFF_CTL_PREF_EN_Msk         0x40000000UL
#define FLASHC_DW0_BUFF_CTL_ENABLED_Pos         31UL
#define FLASHC_DW0_BUFF_CTL_ENABLED_Msk         0x80000000UL
/* FLASHC.DW0_BUFF_CMD */
#define FLASHC_DW0_BUFF_CMD_INV_Pos             0UL
#define FLASHC_DW0_BUFF_CMD_INV_Msk             0x1UL
/* FLASHC.DW1_BUFF_CTL */
#define FLASHC_DW1_BUFF_CTL_PREF_EN_Pos         30UL
#define FLASHC_DW1_BUFF_CTL_PREF_EN_Msk         0x40000000UL
#define FLASHC_DW1_BUFF_CTL_ENABLED_Pos         31UL
#define FLASHC_DW1_BUFF_CTL_ENABLED_Msk         0x80000000UL
/* FLASHC.DW1_BUFF_CMD */
#define FLASHC_DW1_BUFF_CMD_INV_Pos             0UL
#define FLASHC_DW1_BUFF_CMD_INV_Msk             0x1UL
/* FLASHC.DAP_BUFF_CTL */
#define FLASHC_DAP_BUFF_CTL_PREF_EN_Pos         30UL
#define FLASHC_DAP_BUFF_CTL_PREF_EN_Msk         0x40000000UL
#define FLASHC_DAP_BUFF_CTL_ENABLED_Pos         31UL
#define FLASHC_DAP_BUFF_CTL_ENABLED_Msk         0x80000000UL
/* FLASHC.DAP_BUFF_CMD */
#define FLASHC_DAP_BUFF_CMD_INV_Pos             0UL
#define FLASHC_DAP_BUFF_CMD_INV_Msk             0x1UL
/* FLASHC.EXT_MS0_BUFF_CTL */
#define FLASHC_EXT_MS0_BUFF_CTL_PREF_EN_Pos     30UL
#define FLASHC_EXT_MS0_BUFF_CTL_PREF_EN_Msk     0x40000000UL
#define FLASHC_EXT_MS0_BUFF_CTL_ENABLED_Pos     31UL
#define FLASHC_EXT_MS0_BUFF_CTL_ENABLED_Msk     0x80000000UL
/* FLASHC.EXT_MS0_BUFF_CMD */
#define FLASHC_EXT_MS0_BUFF_CMD_INV_Pos         0UL
#define FLASHC_EXT_MS0_BUFF_CMD_INV_Msk         0x1UL
/* FLASHC.EXT_MS1_BUFF_CTL */
#define FLASHC_EXT_MS1_BUFF_CTL_PREF_EN_Pos     30UL
#define FLASHC_EXT_MS1_BUFF_CTL_PREF_EN_Msk     0x40000000UL
#define FLASHC_EXT_MS1_BUFF_CTL_ENABLED_Pos     31UL
#define FLASHC_EXT_MS1_BUFF_CTL_ENABLED_Msk     0x80000000UL
/* FLASHC.EXT_MS1_BUFF_CMD */
#define FLASHC_EXT_MS1_BUFF_CMD_INV_Pos         0UL
#define FLASHC_EXT_MS1_BUFF_CMD_INV_Msk         0x1UL


#endif /* _CYIP_FLASHC_H_ */


/* [] END OF FILE */
